In [1]:
import pandas as pd

In [645]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2010_1102/06000.htm')

In [646]:
df = df[2]

In [647]:
df.shape

(5, 8)

In [648]:
df.head(5)

,0,1,2,3,4,5,6,7
0,NaN,NaN,"Hendrix (NP) 8,545","Sweat (NP) 24,777","Totals 33,322",NaN,NaN,NaN
1,NaN,NaN,25.6%,74.4%,100.0%,NaN,NaN,NaN
2,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN
3,CLARKE,100%,5407,17005,22412,NaN,NaN,NaN
4,OCONEE,100%,3138,7772,10910,NaN,NaN,NaN

In [649]:
df = df[3:]

In [650]:
df.head(5)

        0     1     2      3      4   5   6   7
3  CLARKE  100%  5407  17005  22412 NaN NaN NaN
4  OCONEE  100%  3138   7772  10910 NaN NaN NaN

In [651]:
df = df[df.columns[[0,2,3]]]

In [652]:
df.head(5)

        0     2      3
3  CLARKE  5407  17005
4  OCONEE  3138   7772

In [653]:
df.columns = ['county', 'Pamela Lohr Hendrix', 'David Russell Sweat']

In [654]:
df.tail(5)

   county Pamela Lohr Hendrix David Russell Sweat
3  CLARKE                5407               17005
4  OCONEE                3138                7772

In [655]:
df = df.melt(id_vars=['county'])

In [656]:
df.columns = ['county', 'candidate', 'votes']

In [657]:
df.head()

   county            candidate  votes
0  CLARKE  Pamela Lohr Hendrix   5407
1  OCONEE  Pamela Lohr Hendrix   3138
2  CLARKE  David Russell Sweat  17005
3  OCONEE  David Russell Sweat   7772

In [658]:
df['votes'] = df['votes'].astype(int)

In [659]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   county     4 non-null      object
 1   candidate  4 non-null      object
 2   votes      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [660]:
df['office'] = 'Superior Court Judge'
df['district'] = 'Western Circuit'
df['party'] = 'Nonpartisan'
# df['party'] = 'Democrat'
# df['party'] = 'Republican'

In [661]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate            party
David Russell Sweat  Nonpartisan    24777
Pamela Lohr Hendrix  Nonpartisan     8545
Name: votes, dtype: int64

In [662]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,CLARKE,Superior Court Judge,Western Circuit,Nonpartisan,Pamela Lohr Hendrix,5407
1,OCONEE,Superior Court Judge,Western Circuit,Nonpartisan,Pamela Lohr Hendrix,3138
2,CLARKE,Superior Court Judge,Western Circuit,Nonpartisan,David Russell Sweat,17005
3,OCONEE,Superior Court Judge,Western Circuit,Nonpartisan,David Russell Sweat,7772

In [663]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')